test.yml
config:
  target: "http://localhost:3002" # Socket.io 서버 주소
  phases:
    - duration: 60    # 테스트 지속 시간 (초)
      arrivalCount: 10 # 초당 10개의 새로운 사용자 연결
  engines:
    socketio: {}      # Socket.io 엔진 사용
scenarios:
  - engine: "socketio"
    flow:
      - emit:
          channel: "createRoom" # emit할 Socket.io 이벤트
          data:
            roomId: "dshjifglahwesidsflhe" # 전송 데이터
      - wait: 5 # 5초 대기